[{
  "url": ["https://www.amazon.com/Garnier-SkinActive-Moisture-Rescue-Moisturizer/dp/B00ALB397Y?SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B00ALB397Y"],
  "brand": ["Garnier"],
  "manufacturer": ["Garnier Skin"],
  "model": ["Moisture Rescue"],
  "title": ["Garnier SkinActive Moisture Rescue Face Moisturizer, Dry Skin, 1.7 oz."],
  "features": ["Instantly locks in 24hr moisture and soothes dry skin", "Vitamin c and fruit water antioxidant complex", "With continued use, moisture barrier is strengthened and skin looks healthier and feels softer", "See a visible reduction in roughness caused by dryness"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41Zicr893nL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Amara-Organics-Moisturizer-Resveratrol-Peptides/dp/B00OC0DUNI?SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B00OC0DUNI"],
  "brand": ["Amara Organics"],
  "manufacturer": ["Amara Organics"],
  "model": ["NA"],
  "title": ["Amara Organics Anti Aging Face Cream Moisturizer with Resveratrol & Peptides, 2 fl. oz."],
  "features": ["6 powerful anti-aging ingredients in one to improve skin elasticity, texture, and tone", "Nourishing vitamins and antioxidants repair skin on a cellular level for a smooth, radiant complexion", "Lightweight, non-greasy moisturizer sinks right in, leaving skin silky soft and smooth", "Natural and organic ingredients; no parabens, dyes or fragrances; vegan & cruelty-free; made in USA", "Manufacturer's Guarantee: 100% money back guarantee, no questions asked, and no returns necessary"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41h1cxLXNxL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Cetaphil-Dermacontrol-Moisturizer-Fluid-Ounce/dp/B006L2137U?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B006L2137U"],
  "brand": ["Cetaphil"],
  "manufacturer": ["Galderma Laboratories, Inc"],
  "model": ["Cet-6879"],
  "title": ["Cetaphil Dermacontrol Moisturizer SPF 30, 4 Fluid Ounce"],
  "features": ["3-in-1 formula to control oil, hydrate, and provide broad-spectrum UVA/UVB protection", "Micropearl technology provides a matte finish", "Formulated with Oleosome technology which uses fewer filters forl less irritation and greater hydration", "Shown to reduce dryness and roughness in patients using acne prescription treatments", "Paraben free, fragrance free, won't clog pores"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/313dyZCsSNL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Alba-Botanica-Hawaiian-Oil-Free-Moisturizer/dp/B000E3BZUW?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B000E3BZUW"],
  "brand": ["Alba Botanica"],
  "manufacturer": ["Alba Botanica"],
  "model": ["U-SC-1951"],
  "title": ["Alba Botanica Hawaiian, Aloe & Green Tea Oil-Free Moisturizer, 3 Ounce"],
  "features": ["Minimizes the appearance of pores for a soft, smooth and radiant complexion", "Light cream with aloe, green tea antioxidants and refining humectants lightly replenishs nutrients and moisture", "100% vegetarian ingredients", "No animal testing", "NO: parabens, phthalates, or synthetic fragrances"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41kNDc6cXDL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Active-Wow-Retinol-2-5%25-Moisturizer/dp/B074MG52YQ?SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B074MG52YQ"],
  "brand": ["Active Wow"],
  "manufacturer": ["Active Wow"],
  "title": ["Active Wow Retinol 2.5% Deep Moisturizer - for Face and Eyes"],
  "features": ["Moisturizes and hydrates your skin deep within your pores: Smoothes and refines texture in the delicate eye area", "Reduces signs of aging: Perfect for treating puffiness, wrinkles, crow's feet, and dark circles", "Rejuvenates your eyes and face: Reveal your true natural complexity", "Non-irritating for delicate and sensitive skin: Made with 2.5% retinol and a natural mineral blend"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41tstyDCFoL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/EltaMD-intense-Moisturizer-2-8-oz/dp/B001FYXAKW?SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B001FYXAKW"],
  "brand": ["EltaMD"],
  "manufacturer": ["SETAF"],
  "model": ["Setaf_mx_311"],
  "title": ["EltaMD intense Moisturizer, 2.8 oz"],
  "features": ["Melts on contact", "Retains 90% of skin&rsquo;s moisture for at least 12 hours", "Soothes irritation, redness and flaking", "Helps relieve skin problems associated with diabetes, renal disease and medications such as retinoic", "EltaMD Moisturizer also works well on minor to severe burns, including sunburn."],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/3162m-Clf7L._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Moisturizer-Anti-Aging-Wrinkles-Circles-Ingredients/dp/B0166W9GMI?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B0166W9GMI"],
  "brand": ["TruSkin Naturals"],
  "manufacturer": ["TruSkin Naturals"],
  "model": ["TSN-DF-CM-2OZ"],
  "title": ["BEST Vitamin C Moisturizer Cream for Face for Anti-Aging, Wrinkles, Age Spots, Skin Tone, Firming, and Dark Circles. Organic and Natural Ingredients"],
  "features": ["POWERFUL RESTORATIVE ANTI AGING FORMULA - Supercharged blend of 15% Vitamin C and potent antioxidants combine with Vitamin B5, MSM, Jojoba Oil and Green Tea for a lightweight, ultra-effective daily facial lotion made for all skin types.", "THE DIFFERENCE in skin treated with TruSkin Naturals Vitamin C Daily Facial Moisturizer is striking. In addition to its powerful anti aging properties, customers have reported that this creamy proprietary daily moisturizer has helped to smooth & hydrate skin, shrink pores, clear up acne, prevent breakouts, and minimize the appearance of acne scars - giving skin a radiant, healthy and glowing appearance.", "THE BENEFITS OF VITAMIN C are unparalleled - A powerhouse antioxidant known for brightening skin tone and diminishing signs of sun damage like Dark Spots, Sun Spots, Age Spots, and Hyperpigmentation, vitamin C is proven to boost skin's natural sun protection, refine skin texture and fade the look of fine lines and wrinkles.", "HIGHEST QUALITY INGREDIENTS - Formulated with only the highest quality natural & organic ingredients, this concentrated Vitamin C Daily Moisturizing cream is surprisingly gentle and the perfect solution for even the most sensitive skin types. CRUELTY FREE, Paraben-Free, Corn-Free, Soy-Free, Vegan Formula. Suitable For All Skin Types. Proudly Made in the USA", "100% CUSTOMER SATISFACTION GUARANTEE - TruSkin Naturals is a different kind of company that offers the absolute best customer service in the industry. If for any reason you decide that this moisturizing cream is not for you, you have aFULL 3 MONTHS to send 1 simple email and receive a 100% money-back refund, absolutely no questions asked (in fact, you don't even have to return the bottle)."],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/51884nSz2nL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/NIVEA-Extended-Moisture-Lotion-Fluid/dp/B00DG8EZKO?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B00DG8EZKO"],
  "brand": ["Nivea"],
  "manufacturer": ["Nivea"],
  "model": ["072140011529"],
  "title": ["NIVEA Extended Moisture Body Lotion 16.9 Fluid Ounce"],
  "features": ["Dermatologically tested and approved", "With provitamin B5 and HYDRA IQ Technology", "Free of artificial colors and animal derived ingredients", "Non-greasy formula relieves dry, tight skin for up to 48 hours", "Provides ultra-long lasting moisture"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/31OfHZQY5gL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Clean-Clear-ESSENTIALS-Action-Moisturizer/dp/B000052YJM?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B000052YJM"],
  "brand": ["Clean & Clear"],
  "manufacturer": ["Clean & Clear"],
  "model": ["1515"],
  "title": ["Clean & Clear ESSENTIALS Dual Action Moisturizer, 4 Ounce"],
  "features": ["Treats and helps prevent pimples", "OilFree", "Salicylic Acid (05%)", "Moisturizes dry skin", "Please read all label information on delivery"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/31cAihmntsL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Cremo-Moisturizer-Astonishingly-Superior-Fluid/dp/B009WQ9YXM?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B009WQ9YXM"],
  "brand": ["Cremo"],
  "manufacturer": ["Cremo"],
  "title": ["Cremo Face Moisturizer, Astonishingly Superior 24 Hour Face Moisturizer, 4.4 Fluid Ounce"],
  "features": ["Astonishingly superior face moisturizer that immediately and dramatically heals, soothes, and hydrates for 24 hours without leaving skin sticky, shiny, greasy or oily", "100% Made in the USA with only the best, natural ingredients including Safflower Oil, Avocado Oil, Jojoba Oil, Algae Extract, Mugwort Extract, and Aloe", "Contains calming, natural anti-inflammatory, Triple-A Complex, with a uniquely light formula that spreads and absorbs quickly", "Perfect for sensitive skins, with immediate and long-term benefits of soothed, visibly improved skin that looks & feels fresh & healthy", "Includes one (1) 4.4 ounce tubes. Paraben Free. Not tested on animals"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41Fn99vRKIL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Cetaphil-Restoraderm-Calming-Moisturizer-10-Fluid/dp/B003TQU1Q0?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B003TQU1Q0"],
  "brand": ["Cetaphil"],
  "manufacturer": ["Cetaphil"],
  "model": ["U-SC-2160"],
  "title": ["Cetaphil Restoraderm Eczema Calming Body Moisturizer, 10-Fluid Ounces"],
  "features": ["Free of fragrances, parabens and nut oils", "Easily absorbed and restores moisture to help repair the skins barrier", "Clinically proven to provide immediate and long-lasting miniaturization of dry and itchy skin", "Ceramide technology helps repair the skin barrier", "Avoid contact with eyes", "Clinically proven to provide immediate and long-lasting moisturization of dry and itchy skin", "Ceramide technology helps repair the skin barrier", "Awarded the seal of acceptance from the National Eczema Association", "Safe for babies 3 months and older", "Paraben, nut oil, fragrance, and steroid free", "Packaging may vary"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41dHG43NOoL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Aveeno-Complexion-Blemish-Treatment-Moisturizer/dp/B00006FRW7?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B00006FRW7"],
  "brand": ["Aveeno"],
  "manufacturer": ["Aveeno"],
  "model": ["381370038115"],
  "title": ["Aveeno Clear Complexion Blemish Treatment Daily Moisturizer, 4 Oz"],
  "features": ["4-ounce bottle of facial moisturizer", "Helps prevent breakouts and helps clear up blemishes", "For clearer, more even-looking skin", "Moisture-rich Total Soy Complex", "Salicylic acid treats and fights acne"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41zEv78lQNL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Olay-Total-Effects-Anti-Aging-Moisturizer/dp/B00HB2JQNM?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B00HB2JQNM"],
  "brand": ["Olay"],
  "manufacturer": ["P&G"],
  "model": ["NA"],
  "title": ["Olay Total Effects 7-in-1 Anti-Aging Daily Face Moisturizer With SPF 30, 1.7 fl oz"],
  "features": ["Daily moisturizer with SPF for younger-looking skin", "7 Benefits: Reduces the appearance of age spots, Provides nourishing moisturization, Reduces the appearance of fine lines and wrinkles, Balances and helps even out tone, Smoothes and evens skin texture, Gives skin an instant healthy-looking radiance, Instantly minimizes the appearance of pores", "Broad Spectrum SPF 30 sunscreen helps protect against the sun's harmful rays", "Proven VitaNiacin Complex, with Vitamins C & E, exfoliates to enhance skin's natural self-renewal process for healthier looking skin", "Dermatologically tested, Oil-free and fast-absorbing"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41iKvtAulOL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/YEOUTH-Moisturizer-Extract-Hyaluronic-Peptides/dp/B06X9ZCFG4?SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B06X9ZCFG4"],
  "brand": ["Yeouth"],
  "manufacturer": ["YEOUTH"],
  "title": ["YEOUTH Day Night Moisturizer for Face with Snail Extract, Hyaluronic Acid, Green Tea, and Peptides, Anti Aging Day Cream or Night Cream Moisturizer for Dry Skin, 4 oz - GUARANTEED"],
  "features": ["Lightweight for Day, Hydrating for Night | Leave your skin refreshed and rejuvenated. A revitalizing, lasting, anti-aging moisturizer. It's your one moisturizer for Day or Night. Packed with powerful natural, nourishing, and hydrating active ingredients that delivers results - all natural ingredients that boost elastin and collagen production.", "Snail Extract & Hyaluronic Acid | Snail extracts contain natural activators for damaged and aging skin, stimulating the production of elastin and collagen. The unique properties of snail extract contain key ingredients to promote healthy, beautiful skin. Snail cream is one of the best kept secrets of Korean skin care! Hyaluronic Acid holds and draws impressive amounts of moisture to the skin. In fact, it's able to hold up to 1000 times its molecular weight in water!", "Green Tea & Peptides | Green tea contains very powerful natural antioxidants called polyphenols that neutralizes damaging free radicals. All these can help delay the signs of aging like sun damage, fine lines, wrinkles, and hyperpigmentation. Peptides are amino acid chains that sends signals to the skin's cells to create more collagen, giving the appearance of more youthful, supple skin.", "Safe for all skin types | Normal skin, dry skin, oily skin, combination skin, acne prone skin, even skin with rosacea. Use this product day & night. Spritz face with Yeouth Balancing Facial Toner. If using YEOUTH Hyaluronic Acid Serum or YEOUTH Vitamin C Serum, apply a dime-sized amount onto DAMP skin. Use Radiance Eye Gel around the eye area. Pat skin & allow to absorb, then follow with YEOUTH Day/Night moisturizer, especially on the areas with fine lines, age spots, crow's feet, & wrinkles.", "You can depend on YEOUTH to deliver the highest quality in topical anti-aging skin care products, beauty serums, best wrinkle creams, best anti aging creams, face moisturizers, lotions, toners, and creams available on Amazon and the web today. 100% SATISFACTION GUARANTEE | If you are not COMPLETELY SATISFIED with your Day/Night Moisturizer, return for a full refund. BUY NOW."],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41YMUDDEKhL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Nature-Republic-Super-Combination-Watery/dp/B008191D30?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B008191D30"],
  "brand": ["Nature Republic"],
  "manufacturer": ["Nature Republic"],
  "model": ["NS07-Ccom"],
  "title": ["Nature Republic Super Aqua Max Combination Watery Cream"],
  "features": ["This cream is suitable to combination skin type", "24hr lasting moisture", "80ml"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41uwy5L1f2L._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Body-Merry-Retinol-Surge-Moisturizer/dp/B00OQQLNG4?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B00OQQLNG4"],
  "brand": ["Body Merry"],
  "manufacturer": ["Body Merry"],
  "title": ["Body Merry Retinol Surge Moisturizer - All in one anti aging / wrinkle & acne face cream w natural Hyaluronic Acid + Vitamins for day and night use - Perfect for men & women for deep hydration & care"],
  "features": ["DEFEND & RESTORE your skin's natural beauty with our silky, hydrating retinol cream: This all-in-one anti-aging powerhouse combats most signs of aging, like wrinkles, fine lines, uneven skin tone & spots - even breakouts. If you're looking for soft, healthy, glowing skin, your search is over! This lightweight lotion perfectly delivers intensive moisture to plump, tighten, & help decrease the appearance of lines + pores, making it effective for common problem areas like foreheads, eyes, & necks!", "Our GENEROUSLY SIZED BOTTLE likes to stand out from the competition by giving you more product so that you can maintain your results longer and see those years melt away - All it takes is a small dab and you'll see why this breakthrough cream is the perfect defense for preventative care. You can use this in the daytime or evening to help boost and lift dull or sagging skin! It is gentle enough for whole body care but strong enough to get hydrate and nourish for hours!", "PACKED WITH ANTIOXIDANTS & NUTRIENTS: Our personal philosophy is that you deserve the best that nature & life has to offer and this intensive cream has naturally rich, moisturizing ingredients like green tea, organic jojoba oil, & aloe! This miracle formula is fragrance free, non greasy / oily, and feels more like a light, luxury serum - absorbing quickly within seconds so that in an instant, your skin will feel vibrant, tight, and smooth; give yourself the right treatment and pamper yourself!", "CRUELTY FREE AND SAFE: Our products are vigorously tested to ensure that they are safe and free from irritation for all skin types and hair types, but we would never test on animals - we love our furry (and scaly) friends! Our products use wholesome, all natural ingredients and gentle formulas designed for every skin type (sensitive, normal, dry, oily) and hair color (blonde, brunette, redheads, etc) to give you the best experience possible.", "90-DAY MANUFACTURER GUARANTEE: We love our products and we hope you do too! All of our products are lovingly manufactured in the USA and backed by our 90-Day (Money-back) Happiness Guarantee. If you ever have any questions or if you're not satisfied with your purchase, just drop us a line and we'll see what we can do to help you Get Happy With Your Skin!"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/413PTB7LJ6L._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Brickell-Mens-Daily-Essential-Moisturizer/dp/B00NQ7TJMY?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B00NQ7TJMY"],
  "brand": ["Brickell Men's Products"],
  "manufacturer": ["Brickell Men's Products"],
  "model": ["FM134"],
  "title": ["Brickell Men’s Daily Essential Face Moisturizer for Men – Natural & Organic Face Lotion – 4 oz"],
  "features": ["What It Does: This light, fast-absorbing oil free facial moisturizer for men is packed with potent natural ingredients. Hydrates, nourishes, renews, and protects your face without clogging pores.", "How It Works: Powerful, natural hydrating ingredients quickly soak into the skin to firm and nourish. Green tea and jojoba oil protect the skin from free radicals and damage in this face moisturizer for men.", "Who It's For: Men of any age with any skin type. Men with normal, oily, sensitive, dry, or combo types skin will benefit from this natural men's face moisturizer.", "Who We Are: Brickell creates skincare and grooming products for men using natural & certified organic ingredients. Our products are sold in over 20 countries and have appeared in GQ, Men's Health, Men's Journal, and other popular men's magazines.", "Key Ingredients: Natural & Certified Organic ingredients, including aloe, jojoba oil, vitamin E, hyaluronic acid and green tea. 100% natural, 83% organic."],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41%2BkW4C7voL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Roche-Posay-Toleriane-Double-Repair-Moisturizer/dp/B01NCWV3KM?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B01NCWV3KM"],
  "brand": ["La Roche-Posay"],
  "manufacturer": ["La Roche-Posay"],
  "title": ["La Roche-Posay Toleriane Double Repair Face Moisturizer with SPF 30, 2.5 Fl. Oz."],
  "features": ["Face moisturizer for sensitive skin with broad protection UVA / UVB SPF 30", "Formulated with Glycerin, La Roche-Posay Prebiotic Thermal Water and essential ceramides", "Paraben-free, Fragrance-free"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/413yn%2BTK4ZL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Amara-Organics-Vitamin-Coconut-Butter/dp/B00VGQOU0S?SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B00VGQOU0S"],
  "brand": ["Amara Organics"],
  "manufacturer": ["Amara Organics"],
  "title": ["Amara Organics Vitamin C Cream for Face with Coconut Oil, Cocoa Butter & Jojoba Oil, 1.7 fl. oz."],
  "features": ["This rich cream nourishes skin and leaves it feeling silky soft and smooth", "Apply once and skin stays moisturized all day long", "Softens fine lines, fades age spots, and gives skin a radiant glow", "Natural and organic ingredients; no parabens, dyes or fragrances; Cruelty-Free & Made in USA", "Manufacturer's Guarantee: 100% money back guarantee, no questions asked, and no returns necessary"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41X3Bp9B2oL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Mary-Kay-TimeWise-Fighting-Moisturizer/dp/B000GHGGKK?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B000GHGGKK"],
  "brand": ["Mary Kay"],
  "manufacturer": ["Mary Kay"],
  "model": ["026925"],
  "title": ["Mary Kay TimeWise Age Fighting Moisturizer, Normal/Dry Skin (3 fl. oz.)"],
  "features": ["Reduce the appearance of fine lines for younger-looking skin", "Helps guard against free radicals which cause the skin to age", "Helps accelerate skin's renewal process - hydrates, smooths, firms and softens"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/31aRJi9N7qL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Aveeno-Positively-Moisturizer-Sunscreen-Spectrum/dp/B001IM5VT4?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B001IM5VT4"],
  "brand": ["Aveeno"],
  "manufacturer": ["Aveeno"],
  "model": ["381370036951"],
  "title": ["Aveeno Positively Radiant Daily Moisturizer With Sunscreen Broad Spectrum Spf 15, 4 Oz"],
  "features": ["4-ounce bottle of facial moisturizer", "Helps even skin tone and texture to reveal naturally radiant skin", "For all skin types", "Total Soy Complex", "Broad spectrum SPF 15"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/31vOJTZL2%2BL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Aveeno-Positively-Nourishing-Moisturizer-Comforting/dp/B003K75V72?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B003K75V72"],
  "brand": ["Aveeno"],
  "manufacturer": ["Aveeno"],
  "model": ["J&J426775"],
  "title": ["Aveeno Positively Nourishing Daily Moisturizer Comforting Whipped Soufflé, 6 Oz"],
  "features": ["6-ounce jar of moisturizing soufflé lotion", "Leaves skin luxuriously soft and smooth", "For dry skin", "Soothing oatmeal", "With antioxidants, and shea and cocoa butters"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/51lihP%2B77qL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Retinol-Cream-Moisturizer-Face-Night/dp/B01ES349CY?SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B01ES349CY"],
  "brand": ["LilyAna Naturals"],
  "manufacturer": ["LilyAna Naturals"],
  "title": ["Retinol Cream Moisturizer for Face and Eyes, Use Day and Night - for Anti Aging, Acne, Wrinkles - made with Natural and Organic Ingredients - 1.7 OZ"],
  "features": ["Worried about Retin - A drying out your facial skin? Our advanced, anti aging formula is designed for daily use with maximum prescription strength effectiveness without flaking,peeling or dry skin. Loaded with the best ingredients such as Hyaluronic Acid, Vitamin E, Green Tea, Shae Butter and Jojoba Oil. For men and women and all skin types.", "- You'll see results! Our premium, high potency lotion will produce visible changes with fine lines. Fade sun damage, spots, scars and stretch marks. Improve uneven tone, skin texture and overall appearance. Repair, improve and restore life back into your skin revealing your true beauty.", "- No oily residue left behind. Our creme quickly absorbs without a heavy or sticky feel. Gentle enough for sensitive skin and to use around your eye area helping with dark circles, milia and under eye bags. Use on hands and neck for firming and crepe skin.", "- Works great for blemish prone areas. Won't clog pores, cause breakouts, blackheads, pimples or irritate. Helps with uneven skin tone, fade scars and dark spots and even stretch marks.", "- Light, pleasant smell. Contains no artificial fragrances added and no parabens. Gluten free and not tested on animals."],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/61YjWV9fWhL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Baebody-Retinol-Moisturizer-Cream-Face/dp/B01FLO5914?SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B01FLO5914"],
  "brand": ["Baebody"],
  "manufacturer": ["Baebody"],
  "title": ["Baebody Retinol Moisturizer Cream for Face and Eye Area - With 2.5% Active Retinol, Hyaluronic Acid, Vitamin E. Anti Aging Formula Reduces Wrinkles, Fine Lines. Best Day and Night Cream 1.7 Fl. Oz"],
  "features": ["ACTIVE RETINOL - Our Retinol Cream Fights The Signs Of Aging With Active Retinol, Leaving Your Skin Smooth, Soft, and Glowing. Retinol's Age-Fighting Capabilities Can Help Diminish Most Signs of Aging Such As Wrinkles, Fine Lines, Uneven Skin Tone and Spots With Daily Long Term Use. Improves Skin Tone and Texture Around Your Face, Eye Area, and Neck While Working To Reduce Discoloration, Acne, Sun Damage and Other Marks and Spots.", "71% ORGANIC - Contains Natural and Organic Ingredients Such As Plant Derived Hyaluronic Acid, Wildcrafted Green Tea, Organic Jojoba Oil, Vitamin E, Vitamin B5 and Shea Butter.", "SUPER ANTI AGING MOISTURIZER - Moisturize and Hydrate Dry Skin While Fighting Signs Of Aging. Use Day and Night to Reveal A Brighter and Younger Looking You.", "ALL NATURAL, MADE IN THE USA - No Fillers, Harmful Fragrances, Dyes or Parabens. Manufactured in a GMP Certified and FDA Registered Facility. Our Products are CRUELTY FREE and Not Tested on Animals."],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/51HY6ca%2BDgL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Cetaphil-Daily-Advance-Lotion-Hydrating/dp/B00352MHE2?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B00352MHE2"],
  "brand": ["Cetaphil"],
  "manufacturer": ["Cetaphil"],
  "model": ["GALDERMA430447"],
  "title": ["Cetaphil Daily Advance Lotion, Ultra Hydrating, 16 Ounce"],
  "features": ["Daily skincare designed to intensely hydrate dry, sensitive skin", "Fast acting hydration clinically proven to last 24 hours from a single application", "Ideal for all over body use", "Fragrance free"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41Vbj28r6cL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/MOISTURIZER-Antioxidants-Essential-Hydrating-Frankincense/dp/B072N42W6J?SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B072N42W6J"],
  "brand": ["CircleKit"],
  "manufacturer": ["CircleKit"],
  "title": ["BEST BEAUTY MOISTURIZER FACE CREAM for Women, 100% Natural Antioxidants & Essential Oils, Ultra Hydrating & Calming Skin Daily Formula with Organic Aloe Vera Juice, Coconut, Frankincense, & Lavender!"],
  "features": ["♕ AGE LIKE A QUEEN... As women, we face so many pressures like never before in the history of the world. As wives, mothers, career women, and the backbone of society we are expected to juggle all of our responsibilities AND not let the stress show on our skin. The powerful blend of ingredients in our Day + Night Cream is up to the challenge to combat the daily attacks on your skin to help you age gracefully like the Queen you truly are in just one easy product!", "❤️ THE MIRACLE IS IN THE INGREDIENTS! ❤️ We promise to provide you with only the best possible anti-aging ingredients to calm, repair, and hydrate your skin. Enjoy the healing benefits of Organic Aloe, Rosehip Seed Oil, Coconut Oil, Frankincense, Lavender, Jojoba, Vitamin B5, Vitamin E, and Avocado Oil to name a few of the powerful antioxidant ingredients in our amazing Miracle Day + Night face, neck, décolleté moisturizing creme!", "✈ GREAT FOR TRAVEL AND DAILY USE! The 2 ounce bottle makes it super easy to take your Daily Moisturizer with you on the plane when traveling. No need to pack 10 difference creams, serums, and gels. You just need 1 with our CicleKit Moisturizing Cream! Plus the spill-proof and leak-proof bottle make it the perfect daily moisturizer that you can take with you anywhere.", "✅ THE PERFECT MOISTURIZER FOR UNDER YOUR MAKEUP... We understand the challenge to get a beautiful, dewy look to your makeup without looking greasy, and without using a million products. Who has time for that anyway, right? Our Miracle Face Cream goes the distance to deliver the hydration your skin craves, without making your skin look oily and greasy. The result is a beautiful, smooth, and radiant canvas of skin for your makeup to go on smoothly. #winning", "�� EXPERIENCE THE \"MOISTURIZER YOU'VE BEEN WAITING FOR\" GUARANTEE! If you're anything like most women, you are always on the hunt for the right moisturizer. One that leaves your skin feeling hydrated, soft, and radiant without clogging your pores, feeling greasy, or smelling awful. We are so thrilled to announce that your search is over with our Miracle Face Cream. You can add your miracle cream to your cart, with complete confidence knowing your results are guaranteed!"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41zXIEhqJUL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Faith-Beauty-Whitening-Vanishing-Moisturizer/dp/B075H4XZWV?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B075H4XZWV"],
  "brand": ["Faith Beauty"],
  "manufacturer": ["Faith Beauty"],
  "title": ["Faith Beauty Honey Face Whitening & Vanishing & Anti Aging Cream Moisturizer (Super Capacity 4.6 OZ)"],
  "features": ["Whitening & Honey Smell: Renews the youthful look of skin, Rich and luxurious texture,Honey Smell", "Firming: Firms skin and reduces the appearance of fine lines and wrinkles", "Nourishing: Exfoliates, smoothes and brightens", "Anti Aging: Regenerist enhanced anti ageing moisturiser for eyes, jaw line and neck,face and skin", "Moisturizing & Supply Water: Intensively hydrates for younger-looking skin and face"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41AcTKr9aUL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Calily-Organic-Argan-Cream-Minerals/dp/B01N326Y5O?SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B01N326Y5O"],
  "brand": ["Calily"],
  "manufacturer": ["Calily"],
  "title": ["Calily Life Organic Argan Face Cream with Dead Sea Minerals, 1.7 Oz. – Ultra-Hydrating - Anti-Wrinkle and Anti-Aging - Smooths, Moisturizes and Regenerates"],
  "features": ["ALL-NATURAL & HIGH QUALITY - Produced with high-quality Moroccan Argan Oil, harvested directly from freshly picked fruits and extracted utilizing state-of-the-art techniques. The Argan Oil is then enriched with organic Dead Sea Minerals and extracts, harvested directly at the sun-soaked Dead Sea Valley. Deeply conditions, nourishes and repairs naturally without any chemicals. Organic, Paraben free and FDA compliant. Hypoallergenic and safe for sensitive skin.", "REMOVES WRINKLES & REGENERATES - Comprised of roughly 80% fatty acids, the CalilyLife Organic argan Face Cream works wonders to erase signs of premature aging. Regular use of argan oil cream has been known since ancient times to reduce the depth and severity of wrinkles, as well as to fade age spots by restoring skin's youthful elasticity and by increasing the regenerative rate of healthy skin cells.", "MOISTURIZES & FADES SCARS - The high level of triterpenoids and deep hydration properties naturally found in argan oil offers amazing health benefits for skin including the ability to stunt the growth of warts, treat some forms of dermatitis and fade scars. Combined with the antioxidants and fatty acids, argan oil cream may also help with the treatment of mild acne and with the healing of acne-related scarring.", "PROTECTS & RESTORES - The rich antioxidants naturally present in argan oil helps to protect skin and nails from damage caused by UV radiation. Applying Organic Argan Face Cream to UV damaged skin may actually fade sun spots and heal the dry leathery skin that results from over-exposure to UV, and promote the regeneration of healthy cells.", "PREVENTS & STRENGTHENS - Contains deep moisturizing properties that transforms skin into being amazingly soft and supple, effectively preventing stretch marks and other skin ailments. May be applied to nails to promote stronger, healthier nails naturally with high levels of Vitamin-E. / Being organic, Paraben free and FDA compliant, the Argan Oil Face Cream is hypoallergenic, is safe for sensitive skin and is not associated with any side effects."],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41ssUVkl-6L._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Nouvel-Vitamin-Moisturizer-Certified-Ingredients/dp/B01HKATWCE?SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B01HKATWCE"],
  "brand": ["Nouvel"],
  "manufacturer": ["Nouvel Products, LLC"],
  "model": ["NOUVC2OZ"],
  "title": ["Nouvel Vitamin C Renewal Cream Vegan Face Moisturizer & Hand Cream with Certified Organic Ingredients, 2 fl. oz."],
  "features": ["Vitamin C stimulates collagen production to reduce wrinkles and brighten complexion, while Hyaluronic Acid provides deep and natural moisturizing", "Three powerful antioxidants Vitamins E, B3, and B5 plus Green Tea extract nourish and protect your skin from damage caused by pollution and UV rays", "Organic blend of Coconut Oil, Argan Oil, Avocado Oil, Shea Butter,  and Aloe Vera Leaf  deeply hydrate your skin with no oily look or feel", "Light, non-greasy formula absorbs very quickly and is perfect under makeup or as a hand cream. Fresh and mild Mandarin Orange scent fades quickly", "100% made in the USA without GMO's, parabens, or harsh preservatives and never tested on animals"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/512hVPilCrL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Clean-Clear-Morning-Hydrating-Moisturizer/dp/B00EQWWYQ6?SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B00EQWWYQ6"],
  "brand": ["Clean & Clear"],
  "manufacturer": ["Clean&Clear"],
  "model": ["381371156870"],
  "title": ["Clean & Clear Morning Burst Hydrating Gel Moisturizer, 3 Oz"],
  "features": ["3-ounce tube of facial gel moisturizer", "Wakes you up and leaves skin feeling replenished", "For clean-feeling and refreshed skin", "Contains a unique blend of cucumber and green mango extracts", "Ultra-lightweight and non-greasy gel moisturizer"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/416KkTUIm8L._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/CeraVe-Moisturizing-Cream-Daily-Moisturizer/dp/B001V9SXXU?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B001V9SXXU"],
  "brand": ["CeraVe"],
  "manufacturer": ["Atlas Supply Chain Consulting Services"],
  "model": ["U-SC-2705"],
  "title": ["CeraVe Moisturizing Cream 16 oz Daily Face and Body Moisturizer for Dry Skin"],
  "features": ["Provides 24-hour hydration and helps restore the protective skin barrier with three essential ceramides (1,3,6-II).", "Formulated with hyaluronic acid to help retain skin's natural moisture.", "Utilizes patented MVE® controlled-release technology to help replenish ceramides and deliver long lasting moisturization.", "Free of fragrance and oil, hypoallergenic, non-comedogenic and non-irritating", "Ideal for normal to dry skin"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/51E7zvQyN-L._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Best-Face-Cream-Wrinkles-Aging/dp/B00N9D8PES?SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B00N9D8PES"],
  "brand": ["Andre Lorent"],
  "model": ["NA"],
  "title": ["Best Face Cream for Wrinkles and Anti Aging - Daily Moisturizer with Matrixyl + Argireline + Hyaluronic Acid + Vitamin C + Vitamin E for Wrinkle Repair - Must Have Day Cream for Fine Lines"],
  "features": ["5 POWERFUL ANTI AGING INGREDIENTS IN ONE JAR: Andre Lorent Anti-Aging Face Creme is formulated with 5 active ingredients that fight wrinkles and rejuvenate your skin: Matrixyl, Argireline, Hyaluronic Acid, Vitamin C & Vitamin E. The results on your skin are fantastic! You would normally have to purchase multiple creams to attain the benefits that we pack into one of our jars. Our customers discover they don't want or need to use any other creams on their face, after using our skin cream.", "WORLD WIDE RECOGNITION & CELEBRITIES LOVE OUR SKIN CREAM: Andre Lorent Skin Creams have been seen on ABC, CBS, FOX and hundreds of other media sources. Endorsed by acclaimed Broadway star Alessa Neeck (Cinderella, Little House on the Prairie).", "A 3-MINUTE BEAUTY REGIMEN: After washing in the morning and evening, it takes just 3 minutes to gently apply the cream to your face, neck and decollete. Skin appears plump and radiant immediately after use. Over time our customers experience visible improvements in the appearance of wrinkles, fine lines, laugh lines, dry skin, and uneven skin.", "UNBEATABLE PREMIUM QUALITY STANDARDS: Our Face Creams are handmade according to strict manufacturing standards inside our GMP Certified and FDA-Registered lab. Made in the USA. Our cream is 100% FREE from parabens, SLS (Sodium Lauryl Sulfate) & petrochemical derivatives. Fragrance-free. Non irritating. No additives. No fillers. Everything you've come to expect from Andre Lorent Skin Care.", "TODAY'S SPECIAL COUPON! Save 10% each on Andre Lorent FACE CREAM when you purchase 2 or more. Enter code SAVE1212 at checkout. \"This is an amazing anti-aging cream.\" \"Look Crazy Beautiful now!\""],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41dLNekZAyL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Face-Cream-Moisturizer-Natural-Aging/dp/B00LV5NY3I?SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B00LV5NY3I"],
  "brand": ["LilyAna Naturals"],
  "manufacturer": ["LilyAna Naturals"],
  "title": ["Face Cream Moisturizer (1.7 OZ)  Natural Anti Aging Skin Care"],
  "features": ["Concerned by maturing skin on your face and neck? Dry patches? Fine lines, wrinkles and crow's feet? Our organic, anti-aging. anti-wrinkle facial moisturizer hydrates and softens delicate facial skin to stop the advancement of aging. Hydrating enough to use around the eye area also. Use day and night for real results!", "We use only the best premium moisturizing ingredients like Rose Distillate, Aloe Vera, Vitamin C & E, Coconut Oil, Orange Extract and other essential oils and antioxidants leaving you looking youthful and radiant.", "Great for all skin types including oily, sensitive, acne prone and combination. Our non-greasy advanced formula fully absorbs quickly and leaves no residue and won't clog pores. Our healing cream can even help improve eczema, rosacea and dermatitis. Great for men, women and teens!", "Do you have age spots or damaged skin? Hyper-pigmentation, scaring or redness? Our cream heals, repairs, calms and brightens giving you an even skin tone and smooth, radiant skin.", "Worried about harmful chemicals? Our skincare products have NO Parabens, artificial colors or artificial fragrances, manufactured in the USA and never tested on animals and vegan friendly. When you order now, know that you're protected by a 30 day, no questions asked money back guarantee. Your complete satisfaction is our goal!"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/61sObbsyN0L._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Garnier-SkinActive-Moisture-Rescue-Moisturizer/dp/B003RF82UK?SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B003RF82UK"],
  "brand": ["Garnier"],
  "manufacturer": ["Garnier Hair Color"],
  "model": ["ALO-016"],
  "title": ["Garnier SkinActive Moisture Rescue Face Moisturizer, Normal/Combo Skin, 1.7 oz."],
  "features": ["Instantly locks in 24hr moisture and blocks out dryness", "Face moisturizer formula with vitamin e and fruit water antioxidant complex", "Skin instantly feels fresher and looks smoother", "With continued use, moisture barrier is strengthened and skin looks healthier and more radiant"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41sYtHpZRsL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Moisturizer-Organic-Moisturizing-Sensitive-Severely/dp/B00G0EJYFW?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B00G0EJYFW"],
  "brand": ["Christina Moss Naturals"],
  "manufacturer": ["Christina Moss Naturals"],
  "model": ["NA"],
  "title": ["Facial Moisturizer, Organic and Natural Face Moisturizing Cream for Sensitive, Oily or Severely Dry Skin - Anti-Aging and Anti-Wrinkle, for Women and Men. By Christina Moss Naturals."],
  "features": ["MADE WITH CERTIFIED ORGANIC INGREDIENTS - FREE OF HARMFUL TOXIC PETROCHEMICALS: As such, it contains Star Anise Seed Oil, which gives it a natural, mild licorice scent. This evaporates shortly after application. Our unique blend of ingredients is formulated using our proprietary manufacturing method, which allows our formula to be free of harmful, toxic petrochemicals (as preservatives or otherwise) giving your skin only the nutrients it needs.", "NON-COMEDOGENIC. GREAT FOR SENSITIVE SKIN: Fights off free radicals (the root cause of premature aging). Naturally aids the reduction of fine lines, wrinkles, while deeply moisturizing the face, eye, neck and décolleté. Formulated for deep moisturization and absorption. No fillers or binders. The cream is VERY concentrated. A little goes a long way. Every ingredient has a beneficial effect on the skin, leaving it nourished, moisturized, healthy, smooth and radiant.", "YOU CAN BE BEAUTIFUL AT ANY AGE. YOU DON'T HAVE TO USE CHEMICAL LADEN COSMETICS, NEEDLES OR SURGERY: Our cream gently and thoroughly moisturizes without stripping, drying or leaving build-up. Softens, repairs and reverses damage with natural healing, anti-aging ingredients. Perfect for all skin types. Improves condition of the pores. Hypoallergenic. NO Harmful Chemicals: NO SLS, SLES, Propylene Glycol, Propylene Glycol Derivatives, Parabens, Sulfates, Dyes, Synthetic Fragrance or Preservatives.", "SATISFACTION GUARANTEED. CRUELTY FREE. NO ANIMAL TESTING: Our products are prepared fresh regularly to ensure their optimum best when you receive them. We guarantee purity and freshness for at least six months from purchase. Should anything appear unsatisfactory within that time, simply let us know and we will make it right. NOTE: WITH EVERY PURCHASE, WE INCLUDE OUR HOW TO GUIDE FOR BASIC SKIN CARE, WHICH CONTAINS TWO DIY RECIPES FOR NATURAL FACIAL MASKS.", "THE MISTAKE THAT CAN COST YOUR SKIN'S YOUTH: Fresh, vibrant skin says a lot about a person. The question is, how do you maintain the freshness and vibrancy of youth, naturally? No one ever said they wanted to grow up and have invasive surgery, skin injections or laser treatments. It's expensive, scary, and it often looks quite artificial. There is a solution, though. Human skin is a living organ with the ability to absorb what is applied to it. This is where our products come in."],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41C%2BwR2G4vL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Burts-Bees-Moisturizer-Sensitive-Ounces/dp/B004VMGTY4?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B004VMGTY4"],
  "brand": ["Burt's Bees"],
  "manufacturer": ["Burt's Bees"],
  "model": ["01401-14"],
  "title": ["Burt's Bees Daily Face Moisturizer for Sensitive Skin, 1.8 Ounces"],
  "features": ["1.8 ounce bottle of 99% natural face lotion for sensitive skin in pump style dispenser", "Clinically shown all day hydration without causing redness or irritation, leaving skin feeling beautifully refreshed", "Natural face moisturizer gentle enough for daily use", "Formulated to nurture with rice extract and aloe that soothe and moisturize", "Allergy and dermatologist tested, fragrance free and hypoallergenic"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/31d5DPi%2BZLL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Neutrogena-Oil-Free-Moisture-Sensitive-Skin/dp/B000052YOX?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B000052YOX"],
  "brand": ["Neutrogena"],
  "manufacturer": ["Neutrogena"],
  "model": ["05400"],
  "title": ["Neutrogena Oil-Free Moisture Sensitive Skin, 4 Fl. Oz."],
  "features": ["4-fluid ounce bottle of moisturizer", "Helps leave skin soft and smooth", "Specially formulated for sensitive skin", "Water-based formula for great hydration", "Lightweight and non-greasy"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/31DtxDF835L._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Neutrogena-Hydro-Boost-Gel-Cream-Extra-Dry/dp/B00NR1YQK4?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B00NR1YQK4"],
  "brand": ["Neutrogena"],
  "manufacturer": ["Neutrogena"],
  "title": ["Neutrogena Hydro Boost Gel-Cream, Extra-Dry Skin, 1.7 Oz"],
  "features": ["1.7-ounce jar of gel-cream moisturizer", "Helps quench extra-dry skin to leave it looking smooth, supple, and hydrated", "Hydrating hyaluronic acid acts as a sponge for dry skin cells", "Moisturizing with up to 1,000 times its weight in water", "Oil-, dye-, and fragrance-free moisturizer"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/51LdC84blwL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Radha-Beauty-Retinol-Moisturizer-Cream/dp/B015ORL3B8?SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B015ORL3B8"],
  "brand": ["Radha Beauty"],
  "manufacturer": ["Radha Beauty Products LLC"],
  "model": ["Retinol"],
  "title": ["Radha Beauty Retinol Moisturizer Cream for Face and Eye Area 1.7 Oz - With Retinol, Hyaluronic Acid, vitamin e and Green Tea. Night and Day Moisturizing Cream"],
  "features": ["With Active Retinol to diminish signs of aging with active retinol, leaving your skin soft, smooth and glowing", "Contains natural ingredients such as Organic Aloe, Green Tea, Jojoba oil, Shea Butter.", "Acts as a great Moisturizer that deeply hydrates dry skin", "All Natural No fillers, harmful fragrances, dyes or parabens."],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/410MECGjGAL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Clinique-Dramatically-Different-Moisturizing-Combination/dp/B0079VH0EW?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B0079VH0EW"],
  "brand": ["Clinique"],
  "manufacturer": ["Clinique"],
  "model": ["68LE"],
  "title": ["Clinique Dramatically Different Moisturizing Lotion Plus + With Pump Very Dry To Dry Combination Skin 4.2 Ounce"],
  "features": ["Clinique Dramatically Different Moisturizing Lotion+ with Pump", "Size is 4.2 oz / 125 ml for Very Dry to Dry Combination Skin", "Delivers twice the hydration all day. Skin feels soft, springy and has a glow.", "Helps strengthen skin's own moisture barrier by 54%, so more moisture stays in.", "Apply twice a day to face and throat all over, or where needed."],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41vmYs3mOUL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Dramatically-Different-Moisturizing-Clinique-Ounce/dp/B000OUTTP8?SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B000OUTTP8"],
  "brand": ["Clinique"],
  "manufacturer": ["Clinique"],
  "model": ["0020714222857"],
  "title": ["Dramatically Different Moisturizing Gel By Clinique, 4.2 Ounce"],
  "features": ["Dramatically Different Moisturising Gel by Clinique for Unisex - 4.2 ounces Moisturising Gel", "4.2 ounces Moisturising Gel"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/51LcIvFUnyL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Vanicream-Moisturizing-Skin-Cream-sensitive/dp/B000NWGCZ2?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B000NWGCZ2"],
  "brand": ["Vanicream"],
  "manufacturer": ["Vanicream"],
  "model": ["345334300168"],
  "title": ["Vanicream Moisturizing Skin Cream with pump for sensitive skin - can be used for eczema, psoriasis, ichthyosis, and itch - dermatologist tested – free of dye, fragrance, and preservatives - 16 oz"],
  "features": ["Free of dyes, fragrance, masking fragrance, lanolin, parabens and formaldehyde", "Can be used for skin problems such as atopic dermatitis (eczema), psoriasis, ichthyosis, winter itch", "Dermatologist recommended Gentle on even the most delicate skin", "Used as a night cream, for massage, and as a daily moisturizing cream for face, hands, and body", "Awarded seal of acceptance from the national eczema association with a rating of 5 out of 5 stars"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41up9ZatEsL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/LOreal-Paris-Futur-Moisturizer-Facial/dp/B009X62WM6?SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B009X62WM6"],
  "brand": ["L'Oreal Paris"],
  "manufacturer": ["L'Oreal Paris Skin Care"],
  "model": ["K1246200"],
  "title": ["L'Oreal Paris Futur-e Moisturizer Facial Day Lotion SPF 15, Normal to Dry Skin, 4.0 Ounce"],
  "features": ["Replenishes Moisture.", "Patented BHA Complex to help dull skin.", "Lightweight, non-sticky lotion."],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/31sf64sjR9L._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/NIVEA-Smooth-Daily-Moisture-Lotion/dp/B00DG8F02Q?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B00DG8F02Q"],
  "brand": ["Nivea"],
  "manufacturer": ["Nivea"],
  "model": ["U-BB-2144"],
  "title": ["NIVEA Smooth Daily Moisture Body Lotion 16.9 Fluid Ounce"],
  "features": ["Packaging May Vary", "Lightweight lotion that supplies long lasting moisturization", "Smoothes and nourishes the skin", "Revitalizes the skin", "Absorbs quickly into the skin"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41YA5lNFCAL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Neutrogena-Moisturizer-Sensitive-Spectrum-Sunscreen/dp/B00140ZLXQ?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B00140ZLXQ"],
  "brand": ["Neutrogena"],
  "manufacturer": ["Neutrogena"],
  "model": ["J&J663518"],
  "title": ["Neutrogena Healthy Defense Daily Moisturizer For Sensitive Skin With Broad Spectrum Spf 30 Sunscreen, 1.7 Fl. Oz."],
  "features": ["1.7-fluid ounce tube of daily moisturizer", "Help moisturize and protect skin from sun", "Gentle enough for sensitive skin", "Purescreen Technology naturally-derived sunscreen", "Broad Spectrum SPF 30 protects against UVA/UVB rays"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41wd5jeJQLL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Origins-Ginzing-Energy-boosting-Moisturizer-Fl/dp/B00S28CCKS?SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B00S28CCKS"],
  "brand": ["Origins"],
  "title": ["Origins Ginzing Energy-boosting Moisturizer, 1 Fl. Oz."],
  "features": ["brightening moisturizer", "facial cream"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41-2RMaIa8L._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Natural-Moisturizer-Advanced-Healing-Sensitive/dp/B00LZWV0WY?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B00LZWV0WY"],
  "brand": ["Era Organics"],
  "manufacturer": ["Era Organics"],
  "title": ["Natural Face Moisturizer Cream 4oz Advanced Healing 10-in-1 Non Greasy Formula with Organic Aloe Vera, Manuka Honey, Coconut Oil & More. Best Face Cream for Oily, Dry, Damaged & Sensitive Skin"],
  "features": ["COMPLETE SKIN CARE: Feed your skin all the vitamins, minerals and amino acids it needs for optimum health and healing to make the ideal face moisturizer cream. Includes organic Aloe Vera, Manuka Honey, MSM, Coconut Oil, Shea Butter, Blue Green Algae, Olive Oils, Cocoa Butter and Hemp Seed Oil with vitamins A, B, C, E. It's Superfood for your skin!", "DEEP HYDRATION: Moisturize to the base of your skin, not just on the surface, which lasts up to 8-12 hours. Non-greasy formula fully absorbs and leaves no residue. A little goes a long way to instantly sooth dry, damaged skin.", "REPAIR AND PROTECT: Our natural face moisturizer repairs damaged cells, stimulates new cell growth and restores your skin's natural 5.5 PH balance. ANTI AGING by stimulating collagen production, strengthen fibers, improve elasticity, protect from damaging free radicals while reducing fine lines and wrinkles.", "SAFE AND EFFECTIVE: This hypoallergenic formula is made for sensitive skin-- even safe for children. Non-oily and won't clog pores so safe to use on face, hands, body and feet. No toxins, fragrances, fillers, alcohol or parabens. Since Complete works with your skin's natural biology-- it suits all skin types whether dry, oily, combination or damaged skin.", "BUY WITH CONFIDENCE: Era Organics is family owned and operated, made in the USA. We want you to love your skin, which is why we offer a 60-day money back guarantee. Have questions? Feel free to contact us. We love to hear from our customers (just check our reviews)."],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/51Sua5BzsrL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Moisturizer-Natural-Moisturizing-Sensitive-Skin/dp/B01BD7Q5FC?SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B01BD7Q5FC"],
  "brand": ["Talar Natural Skin Care"],
  "manufacturer": ["Talar Natural Skin Care"],
  "model": ["moist-1"],
  "title": ["Facial Moisturizer, Natural Moisturizing Cream for Oily, Dry, Sensitive Skin - Anti Aging & Anti Wrinkle for both Men & Woman"],
  "features": ["NON GREASY LIGHTWEIGHT, NATURAL INGREDIENTS, NO PARABENS, DYES or FRAGRANCES, VEGAN & CRUELTY FREE, MADE in USA", "ANTI-AGING BENEFIT IN A MOISTURIZER Firm, Reduce Dark Spots, Increase Collagen Production", "RESTORE & HEAL Rejuvenating, Hydrating Hyaluronic Acid, Shea & Mango butte with Grape seed, Coconut and Avocado Oil. Penetrates dry skin & wrinkled skin", "POWERFUL & VITALIZING - Restores and Heals Blemishes Caused by Acne, Aging, Sun, and Skin Allergies", "MANUFACTUERS GUARANTEE, 100% money back guarantee, no questions asked, and no returns necessary"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41zAL9fTn%2BL._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Jack-Black-Double-Duty-Face-Moisturizer/dp/B000HP9M3E?psc=1&SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B000HP9M3E"],
  "brand": ["Jack Black"],
  "manufacturer": ["Jack Black"],
  "model": ["2003"],
  "title": ["Jack Black Double-Duty Face Moisturizer SPF 20, 3.3 fl. oz."],
  "features": ["Ideal for daily use, this lightweight moisturizer is an advanced facial treatment product with a built in broad spectrum sunscreen, SPF 20", "Advanced moisturizing complex locks moisture into the skin and forms a protective barrier to retain moisture", "Blue algae extract, a rich source of vitamin E, helps keep skin supple and reduce inflammation and redness", "Sea parsley, a potent anti-irritant, contains a combination of naturally occurring vitamins (A & C) and minerals which work together to improve skin appearance", "Phospholipids bind moisture to the skin and support the natural skin barrier"],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41fCKlGVn0L._SL160_.jpg"]
}, {
  "url": ["https://www.amazon.com/Moisturizer-Macadamia-Patented-Hydrates-Wrinkles/dp/B0119W7PUA?SubscriptionId=AKIAJYQEGPADE3EZJX2A&tag=alexisherrera-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B0119W7PUA"],
  "brand": ["Yeouth"],
  "manufacturer": ["YEOUTH"],
  "title": ["Best Anti Aging Moisturizer Face Cream, Shea Butter, Jojoba & Macadamia Seed Oil, and Patented L22 Complex From YEOUTH, Hydrates, Firms, Erases Wrinkles and Evens Skin Tone - Day and Night Cream"],
  "features": ["\"Super Soft & Luxurious... Creamy.. Hydrating.. Love this Moisturizer!\"-Cassandra YEOUTH Anti Aging Moisturizer L22 beats other cream, lotion, serum and toner products, making a visible difference in the look of crow's feet, wrinkles and fine lines, improving skin tone and diminishing discoloration from sunspots, blemish and age spots. L22 is safe for all skin types, even the most sensitive skin around the eye and works as an anti wrinkle cream.", "In clinical studies, L-22 anti aging cream demonstrated superiority to other products when evaluated for barrier repair and skin hydration. When evaluated for skin hydration, firmness and elasticity in aged and sun-damaged skin significant improvements were made in trial applicants skin. This is why YEOUTH L22 Face Cream really works, try it now!", "Contains potent organics that go to work day and night defying age on your face, hands, neck, elbows, and décolleté; anywhere on the body a woman or man desires smoother skin. Good for all skin types, oily skin, combination skin, normal skin, and is a moisturizer for dry skin. L22's face moisturizer lipid complex is derived exclusively from natural botanical nutrients including shea butter, jojoba oil, macadamia oil and olive oil. Use as a day cream and night cream for men and women.", "Safe Skin Care: Made in the USA in a FDA registered facility. You can depend on YEOUTH to deliver the highest quality in topical anti aging skin care products, serums, moisturizers, lotions, toners, washes and creams available on Amazon and the web today.", "YEOUTH 100% CUSTOMER SATISFACTION GUARANTEE: Our customers 100% satisfaction is what allows us to continually provide and innovate the highest quality antiaging and beauty products on the market. If you are not completely satisfied with your YOUTH purchase, return it for a full refund. We sincerely thank you for your business and look forward to serving your skin and beauty needs. Order as a gift or for yourself."],
  "imageLink": ["https://images-na.ssl-images-amazon.com/images/I/41iAUz%2BS4QL._SL160_.jpg"]
}]
